validation/full/chemTest/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidName   EMs;
gasName     EMg;

pyrolysisModel    NoPyrolysis;

ConstantCoeffs
{
    mb    mb    [1 -2 1 0 0 0 0]    0.;
    Qc    Qc    [0 2 -2 0 0 0 0]    0.;
}

WSBCoeffs
{
    Ac    Ac    [0 0 -1 0 0 0 0]    1.637e15;
    Ec    Ec    [1 2 -2 0 -1 0 0]   176.e6;
    Qc    Qc    [0 2 -2 0 0 0 0]    400.e3;
    T0    T0    [0 0 0 1 0 0 0]     300.;
}

ignTime   ignTime     [0 0 1 0 0 0 0]     0.;
ignFlux   ignFlux     [1 0 -3 0 0 0 0]    0.;
ignRelax   ignRelax   [0 0 1 0 0 0 0]     0.00;

testPyro  off;

// ************************************************************************* //
